src/InformationRegisters/ДоступностьСайта/ДоступностьСайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступностьСайта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.Публикации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрольПодключений/НастройкиКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПодключений</name>
  <resources>
    <name>МаксимальнаяДатаПрочитанныхЗаписейСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеханизмПроверкиОбрабатыватьИзменения</name>
    <type>
      <types>EnumRef.МеханизмыПроверкиПодключения</types>
    </type>
  </resources>
  <resources>
    <name>URLОпубликованнойИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьЛогинПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПарольПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПроверятьПоЖурналуРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <comment>Максимальное время выполнения контрольной процедуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КонтрольныеПроцедуры/КонтрольныеПроцедуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольныеПроцедуры</name>
  <owners>Catalog.ВидыКонтрольныхПроцедур</owners>
  <attributes>
    <name>Выполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пауза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивацияТолькоСлужебныхЗадачПриОтключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сохранено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОСбое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОВосстановлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИнцидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоЗакрытиеИнцидента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительноеОповещение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОповещенияПриСбое</name>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОповещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ДоступностьСайта/Forms/ФормаУстановитьЗначенияВыбранным/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭтотОбъект.ВыполнятьКонтроль = ЭтотОбъект.Параметры.ВыполнятьКонтроль;
    
    ЭтотОбъект.Таймаут = ЭтотОбъект.Параметры.Таймаут;
    ЭтотОбъект.ТаймаутУстановить = Истина;
    
    ЭтотОбъект.ПериодКонтроля = ЭтотОбъект.Параметры.ПериодКонтроля;
    ЭтотОбъект.ПериодКонтроляУстановить = Истина;
    
    ЭтотОбъект.ПериодичностьКонтроля = ЭтотОбъект.Параметры.ПериодичностьКонтроля;
    ЭтотОбъект.ПериодичностьКонтроляУстановить = Истина;
    
    ЭтотОбъект.МинимальныйПроцентДоступности = ЭтотОбъект.Параметры.МинимальныйПроцентДоступности;
    ЭтотОбъект.МинимальныйПроцентДоступностиУстановить = Истина;
    
    ЭтотОбъект.ДопустимоНетДанных = ЭтотОбъект.Параметры.ДопустимоНетДанных;
    ЭтотОбъект.ДопустимоНетДанныхУстановить = Истина;
    
    Для Каждого ТекРесурс Из ЭтотОбъект.Параметры.Ресурсы Цикл
        
        НовСтрока = ЭтотОбъект.Ресурсы.Добавить();
        НовСтрока.Ресурс = ТекРесурс;
        
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсем(Команда)
    
    УстановитьДоступностьВсем(Истина);
    ИзменитьДоступность();
    
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсем(Команда)
    
    УстановитьДоступностьВсем(Ложь);
    ИзменитьДоступность();
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
    
    ЗаписатьНаСервере();
    ЭтотОбъект.Закрыть("Обновить");
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаймаутУстановитьПриИзменении(Элемент)
    ИзменитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонтроляУстановитьПриИзменении(Элемент)
    ИзменитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьКонтроляУстановитьПриИзменении(Элемент)
    ИзменитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура МинимальныйПроцентДоступностиУстановитьПриИзменении(Элемент)
    ИзменитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ДопустимоНетДанныхУстановитьПриИзменении(Элемент)
    ИзменитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
    
    Для Каждого ТекРесурс Из Ресурсы Цикл
        
        Если ТипЗнч(ТекРесурс.Ресурс) = Тип("СправочникСсылка.Публикации") Тогда
            ЗаписатьПубликацию(ТекРесурс.Ресурс);
        ИначеЕсли ТипЗнч(ТекРесурс.Ресурс) = Тип("СправочникСсылка.Оборудование") Тогда
            ЗаписатьРабочийСервер(ТекРесурс.Ресурс);
        ИначеЕсли ТипЗнч(ТекРесурс.Ресурс) = Тип("СправочникСсылка.ОбъектыКонтроля") Тогда
            ЗаписатьОбъектКонтроля(ТекРесурс.Ресурс);
        КонецЕсли;
                
    КонецЦикла;
        
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПубликацию(Публикация)
    
    СпрОбъект = Публикация.ПолучитьОбъект();
    СпрОбъект.ВыполнятьКонтроль = ЭтотОбъект.ВыполнятьКонтроль;
    Если ЭтотОбъект.ТаймаутУстановить Тогда
        СпрОбъект.Таймаут = ЭтотОбъект.Таймаут;
    КонецЕсли;
    Если ЭтотОбъект.ПериодКонтроляУстановить Тогда
        СпрОбъект.ПериодКонтроля = ЭтотОбъект.ПериодКонтроля;
    КонецЕсли;
    Если ЭтотОбъект.ПериодичностьКонтроляУстановить Тогда
        СпрОбъект.ПериодичностьКонтроля = ЭтотОбъект.ПериодичностьКонтроля;
    КонецЕсли;
    Если ЭтотОбъект.МинимальныйПроцентДоступностиУстановить Тогда
        СпрОбъект.МинимальныйПроцентДоступности = ЭтотОбъект.МинимальныйПроцентДоступности;
    КонецЕсли;
    Если ЭтотОбъект.ДопустимоНетДанныхУстановить Тогда
        СпрОбъект.ДопустимоНетДанных = ЭтотОбъект.ДопустимоНетДанных;
    КонецЕсли;
    СпрОбъект.Записать();
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРабочийСервер(РабочийСервер)
    
    СпрОбъект = РабочийСервер.ПолучитьОбъект();
    СпрОбъект.ПроверятьДоступность = ЭтотОбъект.ВыполнятьКонтроль;
    
    Если ЭтотОбъект.ПериодКонтроляУстановить Тогда
        СпрОбъект.ПериодКонтроля = ЭтотОбъект.ПериодКонтроля;
    КонецЕсли;
    Если ЭтотОбъект.МинимальныйПроцентДоступностиУстановить Тогда
        СпрОбъект.МинимальныйПроцентДоступности = ЭтотОбъект.МинимальныйПроцентДоступности;
    КонецЕсли;
    Если ЭтотОбъект.ДопустимоНетДанныхУстановить Тогда
        СпрОбъект.ДопустимоНетДанных = ЭтотОбъект.ДопустимоНетДанных;
    КонецЕсли;
    
    СпрОбъект.Записать();
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъектКонтроля(ОбъектКонтроля)
    
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   КонтрольныеПроцедуры.Ссылка КАК КонтрольнаяПроцедура
    |ИЗ
    |   Справочник.КонтрольныеПроцедуры КАК КонтрольныеПроцедуры
    |ГДЕ
    |   КонтрольныеПроцедуры.ОбъектКонтроля = &ОбъектКонтроля
    |   И КонтрольныеПроцедуры.Владелец = &Владелец
    |";
    
    Запрос.УстановитьПараметр("ОбъектКонтроля", ОбъектКонтроля);
    Запрос.УстановитьПараметр("Владелец", Справочники.ВидыКонтрольныхПроцедур.НайтиПоНаименованию("Контроль подключений"));
    
    Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        
        КонтрольнаяПроцедура = Выборка.КонтрольнаяПроцедура;
        КонтрольнаяПроцедураОбъект = КонтрольнаяПроцедура.ПолучитьОбъект();
        КонтрольнаяПроцедураОбъект.Выполнять = ЭтотОбъект.ВыполнятьКонтроль;
        КонтрольнаяПроцедураОбъект.Записать();
        
        НастройкиКонтрольнойПроцедуры = РегистрыСведений.НастройкиКонтрольПодключений.СоздатьМенеджерЗаписи();
        НастройкиКонтрольнойПроцедуры.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
        НастройкиКонтрольнойПроцедуры.Прочитать();
        
        НастройкиКонтрольнойПроцедуры.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
        Если ЭтотОбъект.ТаймаутУстановить Тогда
            НастройкиКонтрольнойПроцедуры.Таймаут = ЭтотОбъект.Таймаут;
        КонецЕсли;
        Если ЭтотОбъект.ПериодКонтроляУстановить Тогда
            НастройкиКонтрольнойПроцедуры.ПериодКонтроля = ЭтотОбъект.ПериодКонтроля;
        КонецЕсли;
        Если ЭтотОбъект.МинимальныйПроцентДоступностиУстановить Тогда
            НастройкиКонтрольнойПроцедуры.МинимальныйПроцентДоступности = ЭтотОбъект.МинимальныйПроцентДоступности;
        КонецЕсли;
        Если ЭтотОбъект.ДопустимоНетДанныхУстановить Тогда
            НастройкиКонтрольнойПроцедуры.ДопустимоНетДанных = ЭтотОбъект.ДопустимоНетДанных;
        КонецЕсли;
        НастройкиКонтрольнойПроцедуры.Записать();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступность()
    
    ЭтотОбъект.Элементы.Таймаут.Доступность = ЭтотОбъект.ТаймаутУстановить;
    ЭтотОбъект.Элементы.ПериодКонтроля.Доступность = ЭтотОбъект.ПериодКонтроляУстановить;
    ЭтотОбъект.Элементы.ПериодичностьКонтроля.Доступность = ЭтотОбъект.ПериодичностьКонтроляУстановить;
    ЭтотОбъект.Элементы.МинимальныйПроцентДоступности.Доступность = ЭтотОбъект.МинимальныйПроцентДоступностиУстановить;
    ЭтотОбъект.Элементы.ДопустимоНетДанных.Доступность = ЭтотОбъект.ДопустимоНетДанныхУстановить;    
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВсем(ЗначениеДоступности)
    
    ЭтотОбъект.ТаймаутУстановить = ЗначениеДоступности;
    ЭтотОбъект.ПериодКонтроляУстановить = ЗначениеДоступности;
    ЭтотОбъект.ПериодичностьКонтроляУстановить = ЗначениеДоступности;
    ЭтотОбъект.МинимальныйПроцентДоступностиУстановить = ЗначениеДоступности;
    ЭтотОбъект.ДопустимоНетДанныхУстановить = ЗначениеДоступности;
    
КонецПроцедуры

#КонецОбласти
